# ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter Constructor (ScheduleFieldId, ScheduleFilterType)
ScheduleFilter Class See Also
---
Creates a new ScheduleFilter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFilter(
	ScheduleFieldId fieldId,
	ScheduleFilterType filterType
)
```

Visual Basic
---
```text
Public Sub New ( _
	fieldId As ScheduleFieldId, _
	filterType As ScheduleFilterType _
)
```

Visual C++
---
```text
public:
ScheduleFilter(
	ScheduleFieldId^ fieldId,
	ScheduleFilterType filterType
)
```

# ### Parameters
fieldId
    Type: Autodesk.Revit.DB..::..ScheduleFieldId The ID of the field used to filter the schedule.
filterType
    Type: Autodesk.Revit.DB..::..ScheduleFilterType The filter type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ScheduleFilter Class
ScheduleFilter Overload
Autodesk.Revit.DB Namespace